СкладГП/src/InformationRegisters/НазначенныеПодсборки/НазначенныеПодсборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НазначенныеПодсборки</name>
  <resources>
    <name>Место</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </resources>
  <attributes>
    <name>НомерСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пакет</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/CommonForms/ФормаНазначенныхСборок/Module.bsl
&НаКлиенте
Процедура АктивныеСборкиОбработкаЗапросаОбновления()
	ОбновитьАктивныеСборки();
КонецПроцедуры

&НаСервере
Процедура ОбновитьАктивныеСборки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НазначенныеПодсборки.Место КАК Место,
	|	НазначенныеПодсборки.НомерСпецификации КАК НомерСпецификации,
	|	НазначенныеПодсборки.Покупатель КАК Покупатель,
	|	НазначенныеПодсборки.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.НазначенныеПодсборки КАК НазначенныеПодсборки
	|ГДЕ
	|	НазначенныеПодсборки.Склад В (&Склады)
	|
	|СГРУППИРОВАТЬ ПО
	|	НазначенныеПодсборки.НомерСпецификации,
	|	НазначенныеПодсборки.Покупатель,
	|	НазначенныеПодсборки.Место,
	|	НазначенныеПодсборки.Комментарий";
	Запрос.УстановитьПараметр("Склады", ОбщегоНазначенияВызовСервераПовтИсп.МассивСкладов());
	Выборка = Запрос.Выполнить().Выбрать();
	АктивныеСборки.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Нов = АктивныеСборки.Добавить();
		ЗаполнитьЗначенияСвойств(Нов, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьАктивныеСборки()
КонецПроцедуры

&НаКлиенте
Процедура АктивныеСборкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ТекСтрока = Элементы.АктивныеСборки.ТекущиеДанные;
	Если Не ТекСтрока = Неопределено Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаЗаданияНаВывозку", Новый Структура("Место", ТекСтрока.Место));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	СлужебныйОбновление.НачатьОбменИзменениями(500);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере(); 
	Элементы.АктивныеСборки.Обновить();
КонецПроцедуры
